// I დავალება (4 ქულა)
// მოცემული [key, value] ელემენტების მასივიდან შექმენით შესაბამისი ობიექტი

const entries = [
  ["name", "elpite"],
  ["age", 57],
  ["job", "unemployed"],
  ["address", "mshvidobis 2"],
];

const user = {};

for (const [key, value] of entries) {
  user[key] = value;
}
console.log(user);


// კოდი უნდა დაწეროთ ისე რომ მასივში ნებისმიერი ცვლილებისას(რომელიმე ელემენტის მაგალითად ['name', 'elpite'])
//ამოკლებით შესაბამისი შედეგი მივიღოთ ან კიდევ რამდნეიმე სხვა [key, value] ჩამატებით, მაგალითად ['height', 1.77]
// * თუ რამეა შეგიძლიათ მომმართოთ მინიშნებისთვის, ამ შემთხვევაში 3 ქულა იქნება მაქსიმუმი სწორი პასუხის შემთხვევაში

// II დავალება (4 ქულა)
// 'გააბრტყელეთ მოცემული მასივი , მიღებული შედეგიდან ამოიღეთ null, undefined მნიშვნელობები

const array = [
  1,
  [2, [3, 4, [5, 6, 7]]],
  8,
  [null, 9, [undefined, 10, [null, undefined]]],
  11,
  12,
  13,
  [null],
];

let arr = array.flat(Infinity);
arr = arr.filter(( element )=> {
  return element !== undefined && element !== null;
});

console.log(arr);


//ამოხსნამ უნდა იმუშაოს array მასივში ნებისმიერი ცვლილების შესაბამისად.
//* თუ რამეა შეგიძლიათ მომმართოთ მინიშნებისთვის, ამ შემთხვევაში 3 ქულა იქნება მაქსიმუმი სწორი პასუხის შემთხვევაში

//ჩელენჯი წარმატებულად ჩაითვლება 7 ან მეტი ქულის შემთხვევაში.
//წარმატებები!!!
